; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob92) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 depot1)
	(clear crate5)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate7)
	(at pallet5 distributor2)
	(clear crate1)
	(at pallet6 depot1)
	(clear crate8)
	(at truck0 depot1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 387)
	(at truck1 depot1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 356)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 distributor0)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor2)
	(available hoist9)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 16)
	(at crate1 distributor2)
	(on crate1 pallet5)
	(= (weight crate1) 1)
	(at crate2 distributor1)
	(on crate2 pallet4)
	(= (weight crate2) 31)
	(at crate3 distributor1)
	(on crate3 crate2)
	(= (weight crate3) 20)
	(at crate4 depot1)
	(on crate4 pallet1)
	(= (weight crate4) 9)
	(at crate5 depot1)
	(on crate5 crate4)
	(= (weight crate5) 81)
	(at crate6 depot0)
	(on crate6 crate0)
	(= (weight crate6) 16)
	(at crate7 distributor1)
	(on crate7 crate3)
	(= (weight crate7) 83)
	(at crate8 depot1)
	(on crate8 pallet6)
	(= (weight crate8) 39)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate1)
		(on crate1 pallet3)
		(on crate2 pallet5)
		(on crate3 crate2)
		(on crate5 pallet4)
		(on crate6 crate5)
		(on crate7 pallet1)
		(on crate8 pallet2)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist1 crate8 pallet6 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 pallet6)
   added: (lifting hoist1 crate8) (clear pallet6)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 8
2. (load hoist1 crate8 truck0 depot1)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 39
   goals met: 1 of 8
3. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 1 to 11
   goals met: 1 of 8
4. (unload hoist2 crate8 truck0 depot2)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 39 to 0
   goals met: 1 of 8
5. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 11 to 21
   goals met: 1 of 8
6. (drop hoist2 crate8 pallet2 depot2)
   deleted: (lifting hoist2 crate8) (clear pallet2)
   added: (available hoist2) (at crate8 depot2) (clear crate8) (on crate8 pallet2)
   goals met: 2 of 8
7. (lift hoist0 crate6 crate0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate0)
   added: (lifting hoist0 crate6) (clear crate0)
   changed: (fuel-cost) from 21 to 22
   goals met: 2 of 8
8. (load hoist0 crate6 truck0 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 16
   goals met: 2 of 8
9. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 22 to 23
   goals met: 2 of 8
10. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   changed: (current_load truck0) from 16 to 32
   goals met: 2 of 8
11. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 23 to 33
   goals met: 2 of 8
12. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 33 to 43
   goals met: 2 of 8
13. (unload hoist1 crate6 truck0 depot1)
   deleted: (in crate6 truck0) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck0) from 32 to 16
   goals met: 2 of 8
14. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 43 to 53
   goals met: 2 of 8
15. (unload hoist5 crate0 truck0 distributor2)
   deleted: (in crate0 truck0) (available hoist5)
   added: (lifting hoist5 crate0)
   changed: (current_load truck0) from 16 to 0
   goals met: 2 of 8
16. (lift hoist4 crate7 crate3 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist4) (on crate7 crate3)
   added: (lifting hoist4 crate7) (clear crate3)
   changed: (fuel-cost) from 53 to 54
   goals met: 2 of 8
17. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 54 to 64
   goals met: 2 of 8
18. (load hoist4 crate7 truck0 distributor1)
   deleted: (lifting hoist4 crate7)
   added: (in crate7 truck0) (available hoist4)
   changed: (current_load truck0) from 0 to 83
   goals met: 2 of 8
19. (lift hoist9 crate1 pallet5 distributor2)
   deleted: (at crate1 distributor2) (clear crate1) (available hoist9) (on crate1 pallet5)
   added: (lifting hoist9 crate1) (clear pallet5)
   changed: (fuel-cost) from 64 to 65
   goals met: 2 of 8
20. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 65 to 75
   goals met: 2 of 8
21. (load hoist9 crate1 truck0 distributor2)
   deleted: (lifting hoist9 crate1)
   added: (in crate1 truck0) (available hoist9)
   changed: (current_load truck0) from 83 to 84
   goals met: 2 of 8
22. (load hoist5 crate0 truck0 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck0) (available hoist5)
   changed: (current_load truck0) from 84 to 100
   goals met: 2 of 8
23. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 75 to 85
   goals met: 2 of 8
24. (unload hoist3 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist3)
   added: (lifting hoist3 crate1)
   changed: (current_load truck0) from 100 to 99
   goals met: 2 of 8
25. (drop hoist3 crate1 pallet3 distributor0)
   deleted: (lifting hoist3 crate1) (clear pallet3)
   added: (available hoist3) (at crate1 distributor0) (clear crate1) (on crate1 pallet3)
   goals met: 3 of 8
26. (unload hoist3 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist3)
   added: (lifting hoist3 crate0)
   changed: (current_load truck0) from 99 to 83
   goals met: 3 of 8
27. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 85 to 95
   goals met: 3 of 8
28. (drop hoist3 crate0 crate1 distributor0)
   deleted: (lifting hoist3 crate0) (clear crate1)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 crate1)
   goals met: 4 of 8
29. (load hoist1 crate6 truck1 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 16
   goals met: 4 of 8
30. (lift hoist1 crate5 crate4 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist1) (on crate5 crate4)
   added: (lifting hoist1 crate5) (clear crate4)
   changed: (fuel-cost) from 95 to 96
   goals met: 4 of 8
31. (load hoist1 crate5 truck1 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   changed: (current_load truck1) from 16 to 97
   goals met: 4 of 8
32. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 96 to 106
   goals met: 4 of 8
33. (unload hoist4 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist4)
   added: (lifting hoist4 crate5)
   changed: (current_load truck1) from 97 to 16
   goals met: 4 of 8
34. (lift hoist1 crate4 pallet1 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist1) (on crate4 pallet1)
   added: (lifting hoist1 crate4) (clear pallet1)
   changed: (fuel-cost) from 106 to 107
   goals met: 4 of 8
35. (load hoist1 crate4 truck0 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 83 to 92
   goals met: 4 of 8
36. (unload hoist1 crate7 truck0 depot1)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 92 to 9
   goals met: 4 of 8
37. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 107 to 117
   goals met: 4 of 8
38. (drop hoist1 crate7 pallet1 depot1)
   deleted: (lifting hoist1 crate7) (clear pallet1)
   added: (available hoist1) (at crate7 depot1) (clear crate7) (on crate7 pallet1)
   goals met: 5 of 8
39. (drop hoist4 crate5 crate3 distributor1)
   deleted: (lifting hoist4 crate5) (clear crate3)
   added: (available hoist4) (at crate5 distributor1) (clear crate5) (on crate5 crate3)
   goals met: 5 of 8
40. (lift hoist4 crate5 crate3 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 crate3)
   added: (lifting hoist4 crate5) (clear crate3)
   changed: (fuel-cost) from 117 to 118
   goals met: 5 of 8
41. (load hoist4 crate5 truck1 distributor1)
   deleted: (lifting hoist4 crate5)
   added: (in crate5 truck1) (available hoist4)
   changed: (current_load truck1) from 16 to 97
   goals met: 5 of 8
42. (lift hoist4 crate3 crate2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 crate2)
   added: (lifting hoist4 crate3) (clear crate2)
   changed: (fuel-cost) from 118 to 119
   goals met: 4 of 8
43. (load hoist4 crate3 truck0 distributor1)
   deleted: (lifting hoist4 crate3)
   added: (in crate3 truck0) (available hoist4)
   changed: (current_load truck0) from 9 to 29
   goals met: 4 of 8
44. (lift hoist4 crate2 pallet4 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist4) (on crate2 pallet4)
   added: (lifting hoist4 crate2) (clear pallet4)
   changed: (fuel-cost) from 119 to 120
   goals met: 4 of 8
45. (load hoist4 crate2 truck0 distributor1)
   deleted: (lifting hoist4 crate2)
   added: (in crate2 truck0) (available hoist4)
   changed: (current_load truck0) from 29 to 60
   goals met: 4 of 8
46. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 120 to 130
   goals met: 4 of 8
47. (unload hoist5 crate2 truck0 distributor2)
   deleted: (in crate2 truck0) (available hoist5)
   added: (lifting hoist5 crate2)
   changed: (current_load truck0) from 60 to 29
   goals met: 4 of 8
48. (drop hoist5 crate2 pallet5 distributor2)
   deleted: (lifting hoist5 crate2) (clear pallet5)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 pallet5)
   goals met: 5 of 8
49. (unload hoist5 crate3 truck0 distributor2)
   deleted: (in crate3 truck0) (available hoist5)
   added: (lifting hoist5 crate3)
   changed: (current_load truck0) from 29 to 9
   goals met: 5 of 8
50. (unload hoist4 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist4)
   added: (lifting hoist4 crate5)
   changed: (current_load truck1) from 97 to 16
   goals met: 5 of 8
51. (drop hoist4 crate5 pallet4 distributor1)
   deleted: (lifting hoist4 crate5) (clear pallet4)
   added: (available hoist4) (at crate5 distributor1) (clear crate5) (on crate5 pallet4)
   goals met: 6 of 8
52. (unload hoist4 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist4)
   added: (lifting hoist4 crate6)
   changed: (current_load truck1) from 16 to 0
   goals met: 6 of 8
53. (drop hoist5 crate3 crate2 distributor2)
   deleted: (lifting hoist5 crate3) (clear crate2)
   added: (available hoist5) (at crate3 distributor2) (clear crate3) (on crate3 crate2)
   goals met: 7 of 8
54. (drop hoist4 crate6 crate5 distributor1)
   deleted: (lifting hoist4 crate6) (clear crate5)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 crate5)
   goals met: 8 of 8
